{
  "1": {
    "name": "Perceptible",
    "description": "La información y los componentes de la interfaz de usuario deben ser presentables para los usuarios de manera que puedan percibirlos.",
    "guidelines": {
      "1": {
        "name": "Alternativas de Texto",
        "description": "Proporcionar alternativas en texto para cualquier contenido no textual.",
        "criteria": {
          "1": {
            "name": "Contenido No Textual",
            "level": "A",
            "description": "Todo contenido no textual tiene una alternativa en texto que cumple el mismo propósito.",
            "title": "Texto alternativo"
          }
        }
      },
      "2": {
        "name": "Medios Basados en Tiempo",
        "description": "Proporcionar alternativas para medios basados en tiempo.",
        "criteria": {
          "1": {
            "name": "Solo Audio y Solo Video (Pregrabado)",
            "level": "A",
            "description": "Se proporcionan alternativas para medios basados en tiempo.",
            "title": "Entrevista del blog con transcripción"
          },
          "2": {
            "name": "Subtítulos (Pregrabados)",
            "level": "A",
            "description": "Se proporcionan subtítulos para todo el contenido de audio pregrabado en medios sincronizados.",
            "title": "Anuncio con subtítulos"
          },
          "3": {
            "name": "Descripción de Audio o Alternativa de Medio (Pregrabado)",
            "level": "A",
            "description": "Se proporciona una alternativa para medios basados en tiempo o una descripción de audio para el contenido de video pregrabado.",
            "title": "Presentación con audio descriptivo"
          }
        }
      },
      "3": {
        "name": "Adaptable",
        "description": "Crear contenido que pueda presentarse de diferentes maneras sin perder información ni estructura.",
        "criteria": {
          "1": {
            "name": "Información y Relaciones",
            "level": "A",
            "description": "La información, estructura y relaciones transmitidas mediante la presentación pueden determinarse de forma programática.",
            "title": "Ayuda con encabezados correctos"
          },
          "2": {
            "name": "Secuencia Significativa",
            "level": "A",
            "description": "Cuando la secuencia del contenido afecta su significado, puede determinarse de forma programática una secuencia correcta de lectura.",
            "title": "Orden linear de navegaciónb"
          },
          "3": {
            "name": "Características Sensoriales",
            "level": "A",
            "description": "Las instrucciones proporcionadas no dependen únicamente de las características sensoriales de los componentes.",
            "title": "\"De click\" al crear cuenta"
          }
        }
      },
      "4": {
        "name": "Distinguible",
        "description": "Facilitar que los usuarios puedan ver y escuchar el contenido, incluyendo la separación entre primer plano y fondo.",
        "criteria": {
          "1": {
            "name": "Uso del Color",
            "level": "A",
            "description": "El color no se utiliza como único medio visual para transmitir información.",
            "title": "Indicación de error"
          },
          "2": {
            "name": "Control de Audio",
            "level": "A",
            "description": "Si algún audio se reproduce automáticamente durante más de 3 segundos, se dispone de un mecanismo para pausarlo o detenerlo.",
            "title": "Música al iniciar el sitio web"
          }
        }
      }
    }
  },
  "2": {
    "name": "Operable",
    "description": "Los componentes de la interfaz de usuario y la navegación deben ser operables.",
    "guidelines": {
      "1": {
        "name": "Accesible con Teclado",
        "description": "Hacer que toda la funcionalidad esté disponible desde un teclado.",
        "criteria": {
          "1": {
            "name": "Teclado",
            "level": "A",
            "description": "Toda la funcionalidad está disponible desde un teclado.",
            "title": "[Nombre de la lección]"
          },
          "2": {
            "name": "Sin Trampa de Teclado",
            "level": "A",
            "description": "El foco del teclado puede moverse fuera de un componente utilizando únicamente el teclado.",
            "title": "Trampa de teclado en un producto"
          },
          "4": {
            "name": "Atajos de Teclas de Carácter",
            "level": "A",
            "description": "Si un atajo de teclado utiliza solo letras, signos de puntuación, números o símbolos, entonces puede desactivarse, reasignarse o estar activo solo cuando el componente tiene el foco.",
            "title": "Shortcut para carrito de compras"
          }
        }
      },
      "2": {
        "name": "Tiempo Suficiente",
        "description": "Proporcionar a los usuarios suficiente tiempo para leer y usar el contenido.",
        "criteria": {
          "1": {
            "name": "Tiempo Ajustable",
            "level": "A",
            "description": "Se otorga a los usuarios tiempo suficiente para interactuar con el contenido web.",
            "title": "Contador para pago"
          },
          "2": {
            "name": "Pausar, Detener, Ocultar",
            "level": "A",
            "description": "Los usuarios pueden pausar, detener u ocultar contenido que se inicie automáticamente y dure más de 5 segundos.",
            "title": "Anuncio parpadeante"
          }
        }
      },
      "3": {
        "name": "Convulsiones y Reacciones Físicas",
        "description": "No diseñar contenido de manera que se sepa que pueda causar convulsiones o reacciones físicas.",
        "criteria": {
          "1": {
            "name": "Tres Destellos o por Debajo del Umbral",
            "level": "A",
            "description": "Las páginas web no contienen nada que destelle más de tres veces en un período de un segundo.",
            "title": "Título parpadeante"
          }
        }
      },
      "4": {
        "name": "Navegable",
        "description": "Proporcionar formas de ayudar a los usuarios a navegar, encontrar contenido y determinar dónde se encuentran.",
        "criteria": {
          "1": {
            "name": "Saltar Bloques",
            "level": "A",
            "description": "Existe un mecanismo para saltar bloques de contenido que se repiten en múltiples páginas web.",
            "title": "Saltar contenido"
          },
          "2": {
            "name": "Título de Página",
            "level": "A",
            "description": "Las páginas web tienen títulos que describen el tema o propósito.",
            "title": "Página de titulo dinámico"
          },
          "3": {
            "name": "Orden de Foco",
            "level": "A",
            "description": "Los componentes reciben el foco en un orden que preserva el significado y la operabilidad.",
            "title": "Tabulación de formulario"
          },
          "4": {
            "name": "Propósito del Enlace (en Contexto)",
            "level": "A",
            "description": "El propósito de cada enlace puede determinarse a partir del texto del enlace por sí solo o junto con el contexto del enlace determinado programáticamente.",
            "title": "\"Leer mas\" sobre noticias"
          }
        }
      },
      "5": {
        "name": "Modalidades de Entrada",
        "description": "Facilitar a los usuarios operar la funcionalidad mediante varias entradas más allá del teclado.",
        "criteria": {
          "1": {
            "name": "Gestos de Puntero",
            "level": "A",
            "description": "Toda funcionalidad que utiliza gestos multipunto o basados en trayectorias puede operarse con un solo puntero.",
            "title": "Carrusel de imágenes"
          },
          "2": {
            "name": "Cancelación de Puntero",
            "level": "A",
            "description": "Las funciones que pueden operarse con un solo puntero se completan cuando el usuario suelta el puntero.",
            "title": "Cancelar compra"
          },
          "3": {
            "name": "Etiqueta en el Nombre",
            "level": "A",
            "description": "Para componentes de la interfaz de usuario con etiquetas que incluyen texto o imágenes de texto, el nombre contiene el texto que se presenta visualmente.",
            "title": "Añadir producto descriptivo"
          },
          "4": {
            "name": "Activación por Movimiento",
            "level": "A",
            "description": "La funcionalidad que puede operarse mediante el movimiento del dispositivo o del usuario también puede operarse mediante componentes de la interfaz de usuario.",
            "title": "[Nombre de la lección]"
          }
        }
      }
    }
  },
  "3": {
    "name": "Comprensible",
    "description": "La información y el funcionamiento de la interfaz de usuario deben ser comprensibles.",
    "guidelines": {
      "1": {
        "name": "Legible",
        "description": "Hacer que el contenido textual sea legible y comprensible.",
        "criteria": {
          "1": {
            "name": "Idioma de la Página",
            "level": "A",
            "description": "El idioma humano predeterminado de cada página puede determinarse de forma programática.",
            "title": "Declarar el idioma de la pantalla"
          }
        }
      },
      "2": {
        "name": "Predecible",
        "description": "Hacer que las páginas web aparezcan y funcionen de manera predecible.",
        "criteria": {
          "1": {
            "name": "Al Foco",
            "level": "A",
            "description": "Cuando cualquier componente de la interfaz recibe el foco, no inicia un cambio de contexto.",
            "title": "Redirección de inicio de sesión"
          },
          "2": {
            "name": "Al Introducir Datos",
            "level": "A",
            "description": "Cambiar la configuración de cualquier componente de la interfaz no provoca automáticamente un cambio de contexto.",
            "title": "Activación de inicio de sesión"
          },
          "6": {
            "name": "Configuración Consistente",
            "level": "A",
            "description": "Los cambios en la configuración de cualquier componente de la interfaz de usuario no provocan un cambio de contexto automático a menos que el usuario haya sido advertido.",
            "title": "Botón de ayuda"
          }
        }
      },
      "3": {
        "name": "Asistencia en la Entrada",
        "description": "Ayudar a los usuarios a evitar y corregir errores.",
        "criteria": {
          "1": {
            "name": "Identificación de Errores",
            "level": "A",
            "description": "Si se detecta automáticamente un error de entrada, se identifica el elemento en error y se describe el error al usuario en texto.",
            "title": "Identificación de errores"
          },
          "2": {
            "name": "Etiquetas o Instrucciones",
            "level": "A",
            "description": "Se proporcionan etiquetas o instrucciones cuando el contenido requiere la entrada del usuario.",
            "title": "Etiquetas para añadir una tarjeta"
          },
          "7": {
            "name": "Identificación Redundante",
            "level": "A",
            "description": "Para contenido que requiere entrada del usuario, se proporcionan etiquetas o instrucciones redundantes cuando el contexto lo requiere.",
            "title": "Campos repetidos"
          }
        }
      }
    }
  },
  "4": {
    "name": "Robusto",
    "description": "El contenido debe ser lo suficientemente robusto como para ser interpretado por una amplia variedad de agentes de usuario, incluidas las tecnologías de asistencia.",
    "guidelines": {
      "1": {
        "name": "Compatible",
        "description": "Maximizar la compatibilidad con agentes de usuario actuales y futuros, incluidas las tecnologías de asistencia.",
        "criteria": {
          "2": {
            "name": "Nombre, Rol, Valor",
            "level": "A",
            "description": "Para todos los componentes de la interfaz de usuario, el nombre y el rol pueden determinarse de forma programática; los estados, propiedades y valores pueden configurarse de manera programática.",
            "title": "Blob no legible"
          }
        }
      }
    }
  }
}